vvpai9/Keil/Keil_v5/ARM/Flash/TMS570LS/FlashAPI/device.h

/*************************************************GIO1***********************************************/
#define GIO1                                      0xFFF7BC00                              /*GIO Address*/
#define GIO1_LVL0_INT                              9                                      /*VIM channel number for Level 0 Interrupt*/
#define GIO1_LVL1_INT                              23                                     /*VIM channel number for Level 1 Interrupt*/
#define GIO1_Pins_on_PortA                         8                                      /*Number of Pins Port A*/
#define GIO1_Pins_on_PortB                         8                                      /*Number of Pins Port B*/
#define GIO1_Interrupt_capable_pins_on_PortA       8                                      /*Number of Intr Capable Pins Port A*/


/***********************SPI1*************************/
#define SPI1                       0xFFF7F400                         /*SPI Memory Map : Base Address*/
#define SPI1_LVL0_INT               12                                /*SPI Level 0 interrupt*/
#define SPI1_LVL1_INT               26                                /*SPI Level 1 interrupt*/
#define SPI1_RX_DMA_REQ             0                                 /*SPI RX DMA Request Line*/
#define SPI1_TX_DMA_REQ             1                                 /*SPI TX DMA Request Line*/
#define NUM_SPI1_CS_PINS            4                                 /*No of SPI Chip Select Pins*/
#define NUM_SPI1_ENA_PINS           1                                 /*Is Enable Pin Available*/
#define SPI1_PULLDIS_TIEOFF        0x01010F0F                         /*Reset SPI PULL Disable Value*/
#define SPI1_PULLSEL_TIEOFF        0x00000000                         /*Reset SPI PULL Select Value*/


/***********************LIN*************************/
#define LIN1                       0xFFF7E400                         /*LIN Base Address*/
#define LIN1_LVL0_INT               13                                /*VIM Line LIN Level 0 Interrupt*/
#define LIN1_LVL1_INT               27                                /*VIM Line LIN Level 1 interrupt*/
#define LIN1_RX_DMA_REQ             28                                /*Channel ID for LIN RX DMA Request*/
#define LIN1_TX_DMA_REQ             29                                /*Channel ID for LIN TX DMA Request*/


/***********************NHET1*************************/
#define NHET1                      0xFFF7B800                         /*NHET Base Address*/
#define NHET1_END                  0xFFF7B8FF                         /*NHET End Address (Calculated: 0xFF From NHET Base Address) */
#define NHET1_RAM                  0xFF460000                         /*NHET RAM Base Address*/
#define NHET1_LVL0_INT              10                                /*VIM Line NHET Level 0 Interrupt*/
#define NHET1_LVL1_INT              24                                /*VIM Line NHET Level 1 interrupt*/
#define NHET1_RAM_INIT              3                                 /*NHET Auto-initialization Line*/
#define MEM_CH_NHET1_RAM           0x0008                             /*NHET Auto-initialization Line*/
#define NHET1_RAM_NUMWORDS          127                               /*Implemented NHET RAM*/
#define NUM_NHET1_PINS              24                                /*Number of NHET pins*/
#define NHET1_DMA_REQ4              20                                /*Channel ID for NHET DMA Request(4)*/
#define NHET1_DMA_REQ5              21                                /*Channel ID for NHET DMA Request(5)*/
#define NHET1_DMA_REQ6              24                                /*Channel ID for NHET DMA Request(6)*/
#define NHET1_DMA_REQ7              25                                /*Channel ID for NHET DMA Request(7)*/


/***********************RTI*************************/
#define RTI1                       0xFFFFFC00                         /*RTI Memory Map Address*/
#define RTI1_NODWD                 1                                  /*Digital WatchDog Not Available*/
#define NUM_RTI1_COUNTERS_2        1                                  /*No of FRC OverFlow Interrupts is 2*/
#define NUM_RTI1_CMP_INT_4         1                                  /*No of Compare Units is 4*/
#define RTI1_COMP0_INT             2                                  /*Interrupt Channel For Compare 0*/
#define RTI1_COMP1_INT             3                                  /*Interrupt Channel For Compare 1*/
#define RTI1_COMP2_INT             4                                  /*Interrupt Channel For Compare 2*/
#define RTI1_COMP3_INT             5                                  /*Interrupt Channel For Compare 3*/
#define RTI1_OVL0_INT              6                                  /*Interrupt Channel For FRC0*/
#define RTI1_OVL1_INT              7                                  /*Interrupt Channel For FRC1*/
#define RTI1_TBASE_INT             8                                  /*Timebase Interrupt Channel*/
#define RTI1_DMA_REQ0              12                                 /*DMAREQ number for Compare 0*/
#define RTI1_DMA_REQ1              13                                 /*DMAREQ number for Compare 1*/
#define RTI1_DMA_REQ2              18                                 /*DMAREQ number for Compare 2*/
#define RTI1_DMA_REQ3              19                                 /*DMAREQ number for Compare 3*/


/***********************VIM1*************************/
#define VIM                        0xFFFFFE00                         /*VIM Address In Memory Map*/
#define VIM_RAM                    0xFFF82000                         /*VIM RAM Address*/
#define VIM_PARITY                 0xFFFFFDEC                         /*VIM PARITY Address*/
#define VIM_CHANNELS                64                                /*Total Number of VIM Channels*/
#define PHANTOM_INT                -1                                 /*To be used in VIM_FIQ/VIM_IRQ functions as (PHANTOM_INT + 1)*/
#define VIM_RAM_MEM_INIT            2                                 /*VIM RAM Initialisation line*/
#define NO_NMI_RESV                 2                                 /*Total number of Reserved NMIs*/
#define VIM_NMI_DEFINE              2                                 /*Total number of Reserved NMIs*/
#define VIM_RAM_SIZE               VIM_CHANNELS                       /*Size of VIM RAM Implemented*/
#define INT_REMAP_CH1              12                                 /*VIM Channel 1 Re-mapping*/
#define INT_REMAP_CH2              13                                 /*VIM Channel 2 Re-mapping*/
#define INT_REMAP_CH3              14                                 /*VIM Channel 3 Re-mapping*/
#define INT_REMAP_CH4              15                                 /*VIM Channel 4 Re-mapping*/


/***********************DCAN1*************************/
#define DCAN1                      0xFFF7DC00                         /*DCAN1 Peripheral Select Memory Map: Base Address*/
#define DCAN1_END                  0xFFF7DDFF                         /*DCAN1 Peripheral Select Memory Map: Ending Address*/
#define DCAN1_RAM                  0xFF1E0000                         /*DCAN1 Peripheral RAM: Base Address*/
#define DCAN1_LVL0_INT              16                                /*DCAN1 Request Assignment For Level 0 Interrupt*/
#define DCAN1_LVL1_INT              29                                /*DCAN1 Request Assignment For Level 1 Interrupt*/
#define DCAN1_IF3_INT               44                                /*DCAN1 Request Assignment For Interface Register 3 Interrupt*/
#define DCAN1_IF1_DMA_REQ           8                                 /*DCAN1 DMA request assignment For Interface Register 1*/
#define DCAN1_IF2_DMA_REQ           6                                 /*DCAN1 DMA request assignment For Interface Register 2*/
#define DCAN1_IF3_DMA_REQ           16                                /*DCAN1 DMA request assignment For Interface Register 3*/
#define DCAN1_RAM_INIT              5                                 /*DCAN1 RAM Select (Memory Initialization)*/
#define MEM_CH_DCAN1RAM            0x0020                             /*DCAN1 Bitmap representation of DCAN RAM Select*/
#define DCAN1_MSG_SIZE              64                                /*DCAN1 Total Number of Mailboxes/CAN Messages*/
#define NUM_DCAN1_MESSAGES          64                                /*DCAN1 Total Number of Mailboxes/CAN Messages*/


/***********************DCAN2*************************/
#define DCAN2                      0xFFF7DE00                         /*DCAN2 Peripheral Select Memory Map: Base Address*/
#define DCAN2_END                  0xFFF7DFFF                         /*DCAN2 Peripheral Select Memory Map: Ending Address*/
#define DCAN2_RAM                  0xFF1C0000                         /*DCAN2 Peripheral RAM: Base Address*/
#define DCAN2_LVL0_INT              35                                /*DCAN2 Request Assignment For Level 0 Interrupt*/
#define DCAN2_LVL1_INT              42                                /*DCAN2 Request Assignment For Level 1 Interrupt*/
#define DCAN2_IF3_INT               46                                /*DCAN2 Request Assignment For Interface Register 3 Interrupt*/
#define DCAN2_IF1_DMA_REQ           9                                 /*DCAN2 DMA request assignment For Interface Register 1*/
#define DCAN2_IF2_DMA_REQ           5                                 /*DCAN2 DMA request assignment For Interface Register 2*/
#define DCAN2_IF3_DMA_REQ           4                                 /*DCAN2 DMA request assignment For Interface Register 3*/
#define DCAN2_RAM_INIT              6                                 /*DCAN2 RAM Select (Memory Initialization)*/
#define MEM_CH_DCAN2RAM            0x0040                             /*DCAN2 Bitmap representation of DCAN RAM Select*/
#define DCAN2_MSG_SIZE              64                                /*DCAN2 Total Number of Mailboxes/CAN Messages*/
#define NUM_DCAN2_MESSAGES          64                                /*DCAN2 Total Number of Mailboxes/CAN Messages*/


/***********************MCRC1*************************/
#define MCRC1                      0xFE000000                         /*MCRC Memory Map Address*/
#define NUM_CRC1_CHANNELS_2                                           /*Two Channels : Assumption Chan 0 must be 'All Modes' and Chan 1 must be 'FULL+SEMI+AUTO'*/
#define CRC1_LVL0_INT               19                                /*MCRC Level 0 Interrupt*/
#define CRC1_DMA_REQ0               26                                /*MCRC DMA Request For Channel 0*/
#define CRC1_DMA_REQ1               27                                /*MCRC DMA Request For Channel 1*/


