vvpai9/Keil/Keil_v5/ARM/Flash/TMS570LS/FlashAPI/device.h
/***********************HTU1*************************/
#define HTU1                       0xFFF7A400                         /*HTU Base Address*/
#define HTU1_RAM                   0xFF4E0000                         /*HTU RAM Base Address*/
#define HTU1_LVL0_INT               11                                /*VIM Line for HTU Level 0 Interrupt*/
#define HTU1_LVL1_INT               25                                /*VIM Line for HTU Level 1 Interrupt*/
#define HTU1_RAM_INIT               4                                 /*HTU RAM Memory Auto-initialization Line*/
#define HTU1_END                   0xFFF7A4FF                         /*HTU End Address (Calculated: 0xFF From HTU Base Address) */
#define HTU1_RAM_PARITY            0xFF4E0200                         /*HTU Parity Memory (Calculated: 0x200 From HTU RAM Base Address) */


/***********************MPU1*************************/


/***********************ESM*************************/
#define ESM                        0xFFFFF500                         /*ESM Memory Map Address*/
#define ESM_HIGH_PRIORITY_INT      0                                  /*VIM Line for ESM High Priority Interrupt*/
#define ESM_LOW_PRIORITY_INT       20                                 /*VIM Line for ESM Low Priority Interrupt*/

//CHANNEL MAPPING FOR ESM GROUP 1
#define ESM_G1_CHAN_2              2                                  /*ESM Chan Reserved For DMA - Memory Protection Violation Error*/
#define ESM_G1_CHAN_3              3                                  /*ESM Chan Reserved For DMA - Parity error*/
#define ESM_G1_CHAN_5              5                                  /*ESM Chan Reserved For DMA/AHB-AP imprecise read error*/
#define ESM_G1_CHAN_6              6                                  /*ESM Chan Reserved For FLASH correctable error*/
#define ESM_G1_CHAN_7              7                                  /*ESM Chan Reserved For NHET parity error*/
#define ESM_G1_CHAN_8              8                                  /*ESM Chan Reserved For HET TU T parity error*/
#define ESM_G1_CHAN_9              9                                  /*ESM Chan Reserved For HET TU- Memory Protection Violation Error*/
#define ESM_G1_CHAN_10             10                                 /*ESM Chan Reserved For PLL slip error*/
#define ESM_G1_CHAN_11             11                                 /*ESM Chan Reserved For Clock Monitor interrupt*/
#define ESM_G1_CHAN_13             13                                 /*ESM Chan Reserved For DMA/AHB-AP imprecise write error*/
#define ESM_G1_CHAN_15             15                                 /*ESM Chan Reserved For VIM RAM parity error*/
#define ESM_G1_CHAN_17             17                                 /*ESM Chan Reserved For MIBSPI1 parity error*/
#define ESM_G1_CHAN_18             18                                 /*ESM Chan Reserved For MIBSPI3 parity error*/
#define ESM_G1_CHAN_19             19                                 /*ESM Chan Reserved For MIBADC parity error*/
#define ESM_G1_CHAN_21             21                                 /*ESM Chan Reserved For DCAN1 parity error*/
#define ESM_G1_CHAN_23             23                                 /*ESM Chan Reserved For DCAN2 parity error*/
#define ESM_G1_CHAN_26             26                                 /*ESM Chan Reserved For RAM even Bank correctable error*/
#define ESM_G1_CHAN_27             27                                 /*ESM Chan Reserved For CPU selftest error*/
#define ESM_G1_CHAN_28             28                                 /*ESM Chan Reserved For RAM odd Bank correctable error*/
#define ESM_G1_CHAN_31             31                                 /*ESM Chan Reserved For CCM-R4 selftest error*/
//CHANNEL MAPPING FOR ESM GROUP 2
#define ESM_G2_CHAN_2              2                                  /*ESM Chan Reserved For  CCM-R4 compare fail*/
#define ESM_G2_CHAN_4              4                                  /*ESM Chan Reserved For FLASH uncorrectable error*/
#define ESM_G2_CHAN_6              6                                  /*ESM Chan Reserved For  RAM even Bank uncorrectable error*/
#define ESM_G2_CHAN_8              8                                  /*ESM Chan Reserved For   RAM odd Bank uncorrectable error*/
#define ESM_G2_CHAN_10             10                                 /*ESM Chan Reserved For  RAM even Bank address bus parity error*/
#define ESM_G2_CHAN_12             12                                 /*ESM Chan Reserved For   RAM odd Bank address bus parity error*/
#define ESM_G2_CHAN_16             16                                 /*ESM Chan Reserved For  FLASH ECC livelock detect*/
//CHANNEL MAPPING FOR ESM GROUP 3
#define ESM_G3_CHAN_3              3                                  /*ESM Chan Reserved For   RAM even Bank ECC  uncorrectable error*/
#define ESM_G3_CHAN_5              5                                  /*ESM Chan Reserved For  RAM odd Bank ECC  uncorrectable error*/
#define ESM_G3_CHAN_7              7                                  /*ESM Chan Reserved For  FLASH ECC uncorrectable error*/


/***********************DMA*************************/
#define DMA                        0xFFFFF000                         /*DMA Memory Map Address*/
#define DMA_RAM                    0xFFF80000                         /*DMA RAM Memory Map Address*/
#define DMA_FTC_INT                 33                                /*Interrupt for FTC (Frame Transfer Complete)*/
#define DMA_LFS_INT                 34                                /*Interrupt for LFS (Last Frame Transfer Started)*/
#define DMA_HBC_INT                 39                                /*Interrupt for HBC (First Half of Block Complete)*/
#define DMA_BTC_INT                 40                                /*Interrupt for BTC (Block Transfer Complete)*/
#define NUM_DMA_CHANNELS            16                                /*Total Number of DMA Channels Available*/
#define NUM_DMA_REQUESTS            32                                /*Total Number of DMA Requests*/
#define DMA_RAM_INIT                1                                 /*Memory Initialization Channel Number*/
#define MEM_CH_DMARAM              0x0002                             /*Memory Initialization Channel Hex Bit Mapped*/
#define DMA_MASTER_ID              2                                  /*DMA Master ID*/


/***********************CCM1*************************/
#define CCM1                       0xFFFFF600                         /*CCM Memory Map Address*/


