vvpai9/Keil/Keil_v5/ARM/Flash/TMS570LS/FlashAPI/device.h
/***********************ADM1*************************/
#define ADM1                       0xFFF7C000                         /*ADM1 Peripheral Select Memory Map: Base Address*/
#define MIBADC1_END                0xFFF7C1FF                         /*ADM1 Peripheral Select Memory Map: Ending Address*/
#define MIBADC1_RAM                0xFF3E0000                         /*ADM1 Peripheral RAM: Base Address*/
#define ADM1_EV_INT                 14                                /*ADM1 Event Group Interrupt*/
#define ADM1_GP1_INT                15                                /*ADM1 SW Group1 Interrupt*/
#define ADM1_GP2_INT                28                                /*ADM1 SW Group2 Interrupt*/
#define ADM1_MTCI_INT               31                                /*ADM1 Magnitude Threshold Interrupt*/
#define ADM1_EV_DMA_REQ             7                                 /*ADM1 DMA request assignment For Event Group*/
#define ADM1_G1_DMA_REQ             10                                /*ADM1 DMA request assignment For Group 1*/
#define ADM1_G2_DMA_REQ             11                                /*ADM1 DMA request assignment For Group 2*/
#define ADM1_RAM_INIT               8                                 /*ADM1 RAM Select (Memory Initialization)*/
#define MEM_CH_MIBADC1RAM          0x0100                             /*ADM1 BitMap of RAM Select (Memory Initialization)*/
#define ADM1_NUM_OF_CHAN            20                                /*ADM1 Number Of Channels*/
#define ADM1_NUM_OF_MAGTHR          3                                 /*ADM1 Number of Magnitude Threshold registers*/
#define ADM1_RAM_WORDS              64                                /*ADM1 Number of Words Per Channel*/


/***********************TCRAMW*************************/
#define RAM_ECC_ODD                0xFFFFF900                         /*Base Address of RAM ECC ODD*/
#define RAM_ECC_EVN                0xFFFFF800                         /*Base Address of RAM ECC EVN*/


/***********************FWM_ECC*************************/
#define FLASH                      0xFFF87000                         /*FWM ECC Base Address In Memory Map*/
#define FLASH_ILLEGAL		     0x08140000				    /*Flash Illegal Address*/


/***********************SYS*************************/
#define DEVICE_ID                  0x802A6D05                         /*Device ID*/
#define SYSTEM                     0xFFFFFF00                         /*Memory Map Address of SYS Module*/
#define SYS_SW_INT                 21                                 /*VIM Request Mapping For SSI (System SW interrupt)*/
#define ECLK_PULL                  0                                  /*ECLK Default Pull Up/Down State (1- Up 0-Down)*/
#define ALL_channels               0x000009FE                         /*Bit Mapped Representation Of All Channels*/
#define RAM_ILL_ADDRESS            0x00014000                         /*RAM Illegal Address (Check Illegal Transactions)*/
#define VBUS_ILL_ADDRESS           0xFF1A0000                         /*Illegal Peripheral Address (Check Illegal Transactions)*/
#define PCR                        0xFFFFE000                         /*Memory Map Address of PCR Module*/
#define SRAM_LB                    0x1000                             /*SRAM Lower Boundary (Start Address of RAM + .text sec)*/
#define SRAM_UB                    0x00013FF6                         /*SRAM Upper Boundary (Last Address of RAM - 0xA)*/
#define PMU_INT						22


/***********************MIBSPI3*************************/
#define MIBSPI3                    0xFFF7F800                         /*MIBSPI Memory Map : Base Address*/
#define MIBSPI3_LVL0_INT            37                                /*MIBSPI Level 0 interrupt*/
#define MIBSPI3_LVL1_INT            38                                /*MIBSPI Level 1 interrupt*/
#define MIBSPI3_RAM                0xFF0C0000                         /*MIBSPI RAM Base Address*/
#define MIBSPI3_RAM_WORDS           64                                /*Number of MIBSPI RAM words*/
#define NUM_MIBSPI3_DMA_SOURCES     16                                /*No of MIBSPI DMA Sources Supported*/
#define MIBSPI3_SRC0_DMA_REQ        15                                /*MIBSPI DMA Source 0 Request line*/
#define MIBSPI3_SRC1_DMA_REQ        14                                /*MIBSPI DMA Source 1 Request line*/
#define MIBSPI3_SRC2_DMA_REQ        4                                 /*MIBSPI DMA Source 2 Request line*/
#define MIBSPI3_SRC3_DMA_REQ        5                                 /*MIBSPI DMA Source 3 Request line*/
#define MIBSPI3_SRC4_DMA_REQ        8                                 /*MIBSPI DMA Source 4 Request line*/
#define MIBSPI3_SRC5_DMA_REQ        9                                 /*MIBSPI DMA Source 5 Request line*/
#define MIBSPI3_SRC6_DMA_REQ        12                                /*MIBSPI DMA Source 6 Request line*/
#define MIBSPI3_SRC7_DMA_REQ        13                                /*MIBSPI DMA Source 7 Request line*/
#define MIBSPI3_SRC8_DMA_REQ        16                                /*MIBSPI DMA Source 8 Request line*/
#define MIBSPI3_SRC9_DMA_REQ        17                                /*MIBSPI DMA Source 9 Request line*/
#define MIBSPI3_SRC10_DMA_REQ       22                                /*MIBSPI DMA Source 10 Request line*/
#define MIBSPI3_SRC11_DMA_REQ       23                                /*MIBSPI DMA Source 11 Request line*/
#define MIBSPI3_SRC12_DMA_REQ       26                                /*MIBSPI DMA Source 12 Request line*/
#define MIBSPI3_SRC13_DMA_REQ       27                                /*MIBSPI DMA Source 13 Request line*/
#define MIBSPI3_SRC14_DMA_REQ       30                                /*MIBSPI DMA Source 14 Request line*/
#define MIBSPI3_SRC15_DMA_REQ       31                                /*MIBSPI DMA Source 15 Request line*/
#define SPI3_RX_DMA_REQ             14                                /*MIBSPI(Compatibility Mode) RX DMA Request line*/
#define SPI3_TX_DMA_REQ             15                                /*MIBSPI(Compatibility Mode) TX DMA Request line*/
#define MIBSPI3_RAM_INIT            11                                /*MIBSPI RAM memory auto-initialization*/
#define NUM_MIBSPI3_SIMO_PINS       1                                 /*No of MIBSPI SIMO Pins*/
#define NUM_MIBSPI3_SOMI_PINS       1                                 /*No of MIBSPI SOMI Pins*/
#define NUM_MIBSPI3_CS_PINS         4                                 /*No of MIBSPI Chip Select Pins*/
#define NUM_MIBSPI3_ENA_PINS        1                                 /*Is Enable Pin Available*/
#define NUM_MIBSPI3_TRNSFR_GROUPS   8                                 /*No of Transfer Groups Supported*/


/***********************SPI2*************************/
#define SPI2                       0xFFF7F600                         /*SPI Memory Map : Base Address*/
#define SPI2_LVL0_INT               17                                /*SPI Level 0 interrupt*/
#define SPI2_LVL1_INT               30                                /*SPI Level 1 interrupt*/
#define SPI2_RX_DMA_REQ             2                                 /*SPI RX DMA Request Line*/
#define SPI2_TX_DMA_REQ             3                                 /*SPI TX DMA Request Line*/
#define NUM_SPI2_CS_PINS            1                                 /*No of SPI Chip Select Pins*/
#define NUM_SPI2_ENA_PINS           1                                 /*Is Enable Pin Available*/
#define SPI2_PULLDIS_TIEOFF         0x00000000                        /*Reset SPI PULL Disable Value*/
#define SPI2_PULLSEL_TIEOFF        0x01010F01                         /*Reset SPI PULL Select Value*/


