vvpai9/Keil/Keil_v5/ARM/Flash/TMS570LS/FlashAPI/device.h
/***********************MIBSPI1*************************/
#define MIBSPI1                    0xFFF7F400                         /*MIBSPI Memory Map : Base Address*/
#define MIBSPI1_LVL0_INT            12                                /*MIBSPI Level 0 interrupt*/
#define MIBSPI1_LVL1_INT            26                                /*MIBSPI Level 1 interrupt*/
#define MIBSPI1_RAM                0xFF0E0000                         /*MIBSPI RAM Base Address*/
#define MIBSPI1_RAM_WORDS           128                               /*Number of MIBSPI RAM words*/
#define NUM_MIBSPI1_DMA_SOURCES     16                                /*No of MIBSPI DMA Sources Supported*/
#define MIBSPI1_SRC0_DMA_REQ        1                                 /*MIBSPI DMA Source 0 Request line*/
#define MIBSPI1_SRC1_DMA_REQ        0                                 /*MIBSPI DMA Source 1 Request line*/
#define MIBSPI1_SRC2_DMA_REQ        4                                 /*MIBSPI DMA Source 2 Request line*/
#define MIBSPI1_SRC3_DMA_REQ        5                                 /*MIBSPI DMA Source 3 Request line*/
#define MIBSPI1_SRC4_DMA_REQ        8                                 /*MIBSPI DMA Source 4 Request line*/
#define MIBSPI1_SRC5_DMA_REQ        9                                 /*MIBSPI DMA Source 5 Request line*/
#define MIBSPI1_SRC6_DMA_REQ        12                                /*MIBSPI DMA Source 6 Request line*/
#define MIBSPI1_SRC7_DMA_REQ        13                                /*MIBSPI DMA Source 7 Request line*/
#define MIBSPI1_SRC8_DMA_REQ        16                                /*MIBSPI DMA Source 8 Request line*/
#define MIBSPI1_SRC9_DMA_REQ        17                                /*MIBSPI DMA Source 9 Request line*/
#define MIBSPI1_SRC10_DMA_REQ       22                                /*MIBSPI DMA Source 10 Request line*/
#define MIBSPI1_SRC11_DMA_REQ       23                                /*MIBSPI DMA Source 11 Request line*/
#define MIBSPI1_SRC12_DMA_REQ       26                                /*MIBSPI DMA Source 12 Request line*/
#define MIBSPI1_SRC13_DMA_REQ       27                                /*MIBSPI DMA Source 13 Request line*/
#define MIBSPI1_SRC14_DMA_REQ       30                                /*MIBSPI DMA Source 14 Request line*/
#define MIBSPI1_SRC15_DMA_REQ       31                                /*MIBSPI DMA Source 15 Request line*/
#define SPI1_RX_DMA_REQ             0                                 /*MIBSPI(Compatibility Mode) RX DMA Request line*/
#define SPI1_TX_DMA_REQ             1                                 /*MIBSPI(Compatibility Mode) TX DMA Request line*/
#define MIBSPI1_RAM_INIT            7                                 /*MIBSPI RAM memory auto-initialization*/
#define NUM_MIBSPI1_SIMO_PINS       1                                 /*No of MIBSPI SIMO Pins*/
#define NUM_MIBSPI1_SOMI_PINS       1                                 /*No of MIBSPI SOMI Pins*/
#define NUM_MIBSPI1_CS_PINS         4                                 /*No of MIBSPI Chip Select Pins*/
#define NUM_MIBSPI1_ENA_PINS        1                                 /*Is Enable Pin Available*/
#define NUM_MIBSPI1_TRNSFR_GROUPS   8                                 /*No of Transfer Groups Supported*/


/***********************FWM_ECC*************************/
#define FLASH                      0xFFF87000                         /*FWM ECC Base Address In Memory Map*/


/***********************BMM1*************************/
#define RAM_DMA_CH                  2                                 /*RAM DMA Channel Number*/


/***********************SPI3*************************/
#define SPI3                       0xFFF7F800                         /*SPI Memory Map : Base Address*/
#define SPI3_LVL0_INT               37                                /*SPI Level 0 interrupt*/
#define SPI3_LVL1_INT               38                                /*SPI Level 1 interrupt*/
#define SPI3_RX_DMA_REQ             14                                /*SPI RX DMA Request Line*/
#define SPI3_TX_DMA_REQ             15                                /*SPI TX DMA Request Line*/
#define NUM_SPI3_CS_PINS            4                                 /*No of SPI Chip Select Pins*/
#define NUM_SPI3_ENA_PINS           1                                 /*Is Enable Pin Available*/
#define SPI3_PULLDIS_TIEOFF        0x00000000                         /*Reset SPI PULL Disable Value*/
#define SPI3_PULLSEL_TIEOFF        0x01010F0F                         /*Reset SPI PULL Select Value*/

/******************************************************************************************************************************/

#define PBIST 				0xFFFFE500  	/*Base Address*/

#define PBIST_CH1_ALGO 			0x03			/*PBIST  ROM */
#define PBIST_CH1 			0x0001

#define PBIST_CH2_ALGO 			0x03			/* STC MEM  - ROM*/	
#define PBIST_CH2 			0x0002

#define PBIST_CH3_ALGO 			0x1554			/* DCAN1- Single port*/
#define PBIST_CH3 			0x0004

#define PBIST_CH4_ALGO 			0x1554     		/* DCAN2-Single port */
#define PBIST_CH4 			0x0008

#define PBIST_CH5_ALGO 			0x1554			/* DCAN3 - Reserved-Single port */
#define PBIST_CH5 			0x00010

#define PBIST_CH6_ALGO 			0x1554			/*ESRAM - single Port*/
#define PBIST_CH6 			0x0020

#define PBIST_CH7_ALGO 			0x1554			/* MIBSPI -Single port*/
#define PBIST_CH7 			0x0040

#define PBIST_CH8_ALGO 			0x1554			/* VIM  Single port */
#define PBIST_CH8 			0x0080

#define PBIST_CH9_ALGO 			0x2AA8			/* MIBADC - Two port*/
#define PBIST_CH9 			0x0100

#define PBIST_CH10_ALGO 		0xCAA8	 		/* DMA Two port Only sliced algo */
#define PBIST_CH10 		0x0200

#define PBIST_CH11_ALGO 		0x2AA8			/* HET Two port */
#define PBIST_CH11 		0x0400

#define PBIST_CH12_ALGO 		0x2AA8			/* HTU  Two port */
#define PBIST_CH12 		0x0800


#define PBIST_CH13_ALGO 		0x2AA8			/* RTP two port  - reserved*/
#define PBIST_CH13 		0x1000

/******************************************************************************************************************************/
#define DCC  0xFFFFEC00


/***********************SCI*************************/
#define SCI1                       0xFFF7E400                         /*SCI Base Address*/
#define SCI1_LVL0_INT               13                                /*VIM Line SCI Level 0 Interrupt*/
#define SCI1_LVL1_INT               27                                /*VIM Line SCI Level 1 interrupt*/
#define SCI1_RX_DMA_REQ             28                                /*Channel ID for SCI RX DMA Request*/
#define SCI1_TX_DMA_REQ             29                                /*Channel ID for SCI TX DMA Request*/
